       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MOD400 PIC 999.
       01 WS-MOD100 PIC 99.
       01 WS-MOD4 PIC 9.
       01 WS-RESULT PIC 9.
       01 WS-YEAR PIC 9999.
       01 WS-TEMP PIC 9999.
       PROCEDURE DIVISION. 
       LEAP.
         DIVIDE WS-YEAR BY 400 GIVING WS-TEMP REMAINDER WS-MOD400.
         DIVIDE WS-YEAR BY 100 GIVING WS-TEMP REMAINDER WS-MOD100.
         DIVIDE WS-YEAR BY 4   GIVING WS-TEMP REMAINDER WS-MOD4.
         IF WS-MOD4 = 0 AND (WS-MOD100 <> 0 OR WS-MOD400 = 0)
            MOVE 1 TO WS-RESULT
         ELSE 
            MOVE 0 TO WS-RESULT
         END-IF.
       LEAP-EXIT.
         EXIT.